---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarShapeStartHookLength
source: html/ad377e02-0c26-8fa7-455d-96ce9255bee5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarShapeStartHookLength Property

"Start Hook Length"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarShapeStartHookLength { get; }
```